HM4/hm4.tex
% Created 2015-10-29 Thu 22:32
\documentclass{article}
\usepackage[top=1in, bottom=1.in, left=1in, right=1in]{geometry}
  \usepackage[makeroom]{cancel}
\usepackage{verbatim}


\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage{minted}
\usepackage{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\author{Abhishek Bagusetty}
\date{\today}
\title{24-623 2015 HM4}
\begin{document}

\maketitle

\section{Problem 1}
\label{sec-1}
The regular equations for the velocity verlet scheme are as follows: 

1.$v_{i}(t+\Delta t/2) = v_{i}(t) + F_{i}(t) \Delta/2m_{i}$
2.$r_{i}(t+\Delta t) = r_{i}(t) + v_{i}(t+\Delta t/2)\Delta t$
3.$v_{i}(t+\Delta t) = v_{i}(t+\Delta + F_{i}(t+\Delta t) \Delta/2m_{i}$

With MD simulations in NVT ensemble using the Nose-Hoover thermostat, the following are the equations of motions,

\begin{enumerate}
\item \$\$
\end{enumerate}
\section{Problem 2}
\label{sec-2}
\subsection{a)}
\label{sec-2-1}

Average Pressure is plotted as the function of density between 950 $kg/m^3$ and 1150 $kg/m^3$. A trendline is fit and the zero pressure density is found to be at 1042.8 $kg/m^3$ which slightly varies with the density computed from the previous computations corresponding to 1053.8 $kg/m^3$.

\begin{enumerate}
\item Several NVT simulations are performed with NVT ensemble and Nose-Hoover thermostat and ensuring temperature of 100K is reached for every run.

\item Equlibration is completed, as judged by the lack of energy drift in the 200 units of MD simulation. $\big\langle (E-<E>) \big\rangle$ per atom is in the order of 1e-3 which indicate the energy fluctuations are very small.
\end{enumerate}

Plots of energies, temeprature and pressure are shown below for a configuration approaching zero pressure NVT simulation for 200 LJ units.


\section{Problem 3}
\label{sec-3}
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}